ERP DEV.WMS/src/Catalogs/вмс_МестаХранения/вмс_МестаХранения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>вмс_МестаХранения</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Склады</owners>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЯчейки</name>
    <type>
      <types>EnumRef.вмс_ТипыЯчеек</types>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.КатегорииЯчеекХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.вмс_Помещения</types>
    </type>
  </attributes>
  <attributes>
    <name>СортировкаНомер</name>
    <comment>Сквозная в длину нумерация (техническая)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СортировкаРяд</name>
    <comment>Сквозная в ширину нумерация (техническая)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СортировкаЭтаж</name>
    <comment>Нумерация в высоту (техническая)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаБезразмерная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеТехническое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидСверху</name>
    <comment>ТУ_Августинович 000056225 28.10.2025. Для интерактивной карты</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧастьНаименованияСклад</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧастьНаименованияРяд</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧастьНаименованияСтеллаж</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧастьНаименованияЯрус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧастьНаименованияМесто</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ERP DEV.WMS/src/Enums/вмс_ТипыЯчеек/вмс_ТипыЯчеек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>вмс_ТипыЯчеек</name>
  <enumValues>
    <name>ЗонаПриемки</name>
  </enumValues>
  <enumValues>
    <name>ЗонаОтгрузки</name>
  </enumValues>
  <enumValues>
    <name>Хранение</name>
  </enumValues>
  <enumValues>
    <name>ЗонаОтбора</name>
  </enumValues>
  <enumValues>
    <name>Карантин</name>
  </enumValues>
  <enumValues>
    <name>ЗонаКонтроля</name>
  </enumValues>
  <enumValues>
    <name>Подпитка</name>
  </enumValues>
  <enumValues>
    <name>Оператор</name>
  </enumValues>
  <enumValues>
    <name>Транзит</name>
  </enumValues>
</mdclass:Enum>

ERP DEV.WMS/src/Catalogs/вмс_МестаХранения/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
Процедура ЗарегистрироватьНаОбмен() Экспорт
	
	МассивУзлов = вмс_Обмен_с_КИС_ВызовСервера.ПолучитьУзлыДляОбмена();
	ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, Метаданные.Справочники.вмс_МестаХранения);
	
КонецПроцедуры

Функция ПолучитьЯчейкиПоРодителю(Родитель) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	вмс_МестаХранения.Ссылка КАК Ячейка
	|ИЗ
	|	Справочник.вмс_МестаХранения КАК вмс_МестаХранения
	|ГДЕ
	|	вмс_МестаХранения.Ссылка В ИЕРАРХИИ(&Группа)
	|	И вмс_МестаХранения.Родитель = &Родитель
	|	И вмс_МестаХранения.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Родитель", Родитель);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить(); 
	
	Возврат РезультатЗапроса.ВыгрузитьКолонку("Ячейка");
	
КонецФункции

Функция ПолучитьЗонуПриемки(Склад, СоздатьПриОтсутствии = Истина) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_МестаХранения.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.вмс_МестаХранения КАК вмс_МестаХранения
	|ГДЕ
	|	НЕ вмс_МестаХранения.ЭтоГруппа
	|	И НЕ вмс_МестаХранения.ПометкаУдаления
	|	И вмс_МестаХранения.ТипЯчейки = ЗНАЧЕНИЕ(Перечисление.вмс_ТипыЯчеек.ЗонаПриемки)
	|	И вмс_МестаХранения.Владелец = &Склад";
	
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	Иначе
		ЗонаПриемки = СоздатьЭлемент();
		ЗонаПриемки.Владелец = Склад;
		ЗонаПриемки.ТипЯчейки = Перечисления.вмс_ТипыЯчеек.ЗонаПриемки;
		ЗонаПриемки.Наименование = СтрШаблон("Зона приемки (%1)", Склад);
		ЗонаПриемки.Записать();
		Возврат ЗонаПриемки.Ссылка;
	КонецЕсли;
	
	Возврат ПустаяСсылка();
	
КонецФункции

Функция ПолучитьЗонуОтгрузки(Склад, СоздатьПриОтсутствии = Истина) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_МестаХранения.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.вмс_МестаХранения КАК вмс_МестаХранения
	|ГДЕ
	|	НЕ вмс_МестаХранения.ЭтоГруппа
	|	И НЕ вмс_МестаХранения.ПометкаУдаления
	|	И вмс_МестаХранения.ТипЯчейки = ЗНАЧЕНИЕ(Перечисление.вмс_ТипыЯчеек.ЗонаОтгрузки)
	|	И вмс_МестаХранения.Владелец = &Склад";
	
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	Иначе
		ЗонаОтгрузки = СоздатьЭлемент();
		ЗонаОтгрузки.Владелец = Склад;
		ЗонаОтгрузки.ТипЯчейки = Перечисления.вмс_ТипыЯчеек.ЗонаОтгрузки;
		ЗонаОтгрузки.Наименование = СтрШаблон("Зона отгрузки (%1)", Склад);
		ЗонаОтгрузки.Записать();
		Возврат ЗонаОтгрузки.Ссылка;
	КонецЕсли;
	
	Возврат ПустаяСсылка();
	
КонецФункции

Функция ПолучитьЗонуСклада(Склад, ТипЯчейки, СоздатьПриОтсутствии = Истина) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_МестаХранения.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.вмс_МестаХранения КАК вмс_МестаХранения
	|ГДЕ
	|	НЕ вмс_МестаХранения.ЭтоГруппа
	|	И НЕ вмс_МестаХранения.ПометкаУдаления
	|	И вмс_МестаХранения.ТипЯчейки = &ТипЯчейки
	|	И вмс_МестаХранения.Владелец = &Склад";
	
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("ТипЯчейки", ТипЯчейки);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	Иначе
		СлужебнаяЗона = СоздатьЭлемент();
		СлужебнаяЗона.Владелец = Склад;
		СлужебнаяЗона.ТипЯчейки = ТипЯчейки;
		СлужебнаяЗона.Наименование = СтрШаблон("%1 (%2)", ТипЯчейки, Склад);
		СлужебнаяЗона.Записать();
		Возврат СлужебнаяЗона.Ссылка;
	КонецЕсли;
	
	Возврат ПустаяСсылка();
	
КонецФункции

//3.2.4
Функция ЗаполнитьРеквизитШтрихкод() Экспорт
	
	НачатьТранзакцию();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	вмс_МестаХранения.Ссылка КАК МестоХранения
	|ИЗ
	|	Справочник.вмс_МестаХранения КАК вмс_МестаХранения
	|ГДЕ
	|	вмс_МестаХранения.ЭтоГруппа = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		пОбъект = Выборка.МестоХранения.ПолучитьОбъект();
		пОбъект.ОбменДанными.Загрузка = Истина;
		пОбъект.Штрихкод = пОбъект.Код;
		пОбъект.Записать();
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
КонецФункции

#КонецЕсли
